---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricWireOffset
source: html/9a1308b5-02d8-adbc-f6a8-b26f4c6b77d1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricWireOffset Property

"Offset along wire direction": Offset along wire direction

## Syntax (C#)
```csharp
public static ForgeTypeId FabricWireOffset { get; }
```